In [6]:
import pandas as pd
import numpy as np #mathematical library

In [7]:
df = pd.read_csv('supershops.csv')

In [8]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [9]:
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()
df6 = df.copy()
df7 = df.copy()

1. Normalization
2. Standardization
3. Log Transformation
4. Robust Scaler
5. Max Absolute Scaler

# Normalization

In [10]:
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MinMaxScaler.html

In [11]:
from sklearn.preprocessing import MinMaxScaler
m = MinMaxScaler() #default feature_range=(0,1)

In [12]:
df_ms = m.fit(df[['Marketing Spend']]) # calculation everything

In [13]:
df_ms

MinMaxScaler()

In [14]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [15]:
df[['Marketing_Spend_New']] = m.transform(df[['Marketing Spend']])

In [16]:
df.head()

,Marketing Spend,Administration,Transport,Area,Profit,Marketing_Spend_New
0,114523.61,136897.80,471784.10,Dhaka,192261.83,0.692617
1,162597.70,151377.59,443898.53,Ctg,191792.06,0.983359
2,153441.51,101145.55,407934.54,Rangpur,191050.39,0.927985
3,144372.41,118671.85,383199.62,Dhaka,182901.99,0.873136
4,142107.34,91391.77,366168.42,Rangpur,166187.94,0.859438

In [17]:
df[['Administration']] = m.fit_transform(df[['Administration']])
df.head()

,Marketing Spend,Administration,Transport,Area,Profit,Marketing_Spend_New
0,114523.61,0.651744,471784.10,Dhaka,192261.83,0.692617
1,162597.70,0.761972,443898.53,Ctg,191792.06,0.983359
2,153441.51,0.379579,407934.54,Rangpur,191050.39,0.927985
3,144372.41,0.512998,383199.62,Dhaka,182901.99,0.873136
4,142107.34,0.305328,366168.42,Rangpur,166187.94,0.859438

# Perform Normalization using loop

In [28]:
columns = ['Marketing Spend', 'Administration', 'Transport']

In [29]:
scaler = MinMaxScaler()

In [30]:
for column in columns:
    df[column] = scaler.fit_transform(df[[column]])

In [32]:
df.head(5)

,Marketing Spend,Administration,Transport,Area,Profit,Marketing_Spend_New
0,0.692617,0.651744,1.000000,Dhaka,192261.83,0.692617
1,0.983359,0.761972,0.940893,Ctg,191792.06,0.983359
2,0.927985,0.379579,0.864664,Rangpur,191050.39,0.927985
3,0.873136,0.512998,0.812235,Dhaka,182901.99,0.873136
4,0.859438,0.305328,0.776136,Rangpur,166187.94,0.859438

# Standardization

In [33]:
columns = ['Marketing Spend', 'Administration', 'Transport']

In [35]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

In [36]:
for column in columns:
    df[column] = scaler.fit_transform(df[[column]])

In [38]:
df.head(5)

,Marketing Spend,Administration,Transport,Area,Profit,Marketing_Spend_New
0,0.897913,0.560753,2.165287,Dhaka,192261.83,0.692617
1,1.955860,1.082807,1.929843,Ctg,191792.06,0.983359
2,1.754364,-0.728257,1.626191,Rangpur,191050.39,0.927985
3,1.554784,-0.096365,1.417348,Dhaka,182901.99,0.873136
4,1.504937,-1.079919,1.273550,Rangpur,166187.94,0.859438

# Log Transformation

In [13]:
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.FunctionTransformer.html

In [14]:
from sklearn.preprocessing import FunctionTransformer
ft = FunctionTransformer(np.log1p) #np.log1p will avoid 0

In [15]:
df2.head(2)

   Marketing Spend  Administration  Transport   Area     Profit
0        114523.61       136897.80  471784.10  Dhaka  192261.83
1        162597.70       151377.59  443898.53    Ctg  191792.06

In [16]:
df2['Transport'] = ft.fit_transform(df2[['Transport']])

In [17]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  13.064279    Dhaka  192261.83
1        162597.70       151377.59  13.003354      Ctg  191792.06
2        153441.51       101145.55  12.918864  Rangpur  191050.39
3        144372.41       118671.85  12.856314    Dhaka  182901.99
4        142107.34        91391.77  12.810851  Rangpur  166187.94

# Perform Log using loop

In [39]:
for column in columns:
    df[column] = np.log(df[column])

C:\Users\Tipu Sultan\anaconda3\lib\site-packages\pandas\core\arraylike.py:397: RuntimeWarning: invalid value encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

In [40]:
df.head(5)

,Marketing Spend,Administration,Transport,Area,Profit,Marketing_Spend_New
0,-0.107682,-0.578475,0.772553,Dhaka,192261.83,0.692617
1,0.670830,0.079556,0.657439,Ctg,191792.06,0.983359
2,0.562106,NaN,0.486240,Rangpur,191050.39,0.927985
3,0.441336,NaN,0.348787,Dhaka,182901.99,0.873136
4,0.408751,NaN,0.241808,Rangpur,166187.94,0.859438

# Robust Scaler

In [42]:
from sklearn.preprocessing import RobustScaler
scaler = RobustScaler()

In [43]:
for column in columns:
    df[column] = scaler.fit_transform(df[[column]])

In [44]:
df.head(5)

,Marketing Spend,Administration,Transport,Area,Profit,Marketing_Spend_New
0,0.242965,-0.236716,1.024457,Dhaka,192261.83,0.692617
1,0.754584,0.170925,0.916317,Ctg,191792.06,0.983359
2,0.683133,NaN,0.755491,Rangpur,191050.39,0.927985
3,0.603766,NaN,0.626366,Dhaka,182901.99,0.873136
4,0.582352,NaN,0.525868,Rangpur,166187.94,0.859438

# Max Absolute Scaler

In [46]:
from sklearn.preprocessing import MaxAbsScaler
scaler = MaxAbsScaler()

In [47]:
for column in columns:
    df[column] = scaler.fit_transform(df[[column]])

In [48]:
df.head(5)

,Marketing Spend,Administration,Transport,Area,Profit,Marketing_Spend_New
0,0.079722,-0.084894,0.596038,Dhaka,192261.83,0.692617
1,0.247595,0.061299,0.533121,Ctg,191792.06,0.983359
2,0.224151,NaN,0.439551,Rangpur,191050.39,0.927985
3,0.198109,NaN,0.364425,Dhaka,182901.99,0.873136
4,0.191082,NaN,0.305954,Rangpur,166187.94,0.859438